var timeline = [
    {
        date: "12/10/1944",
        page: 22,
        text: "Απελευθερώνεται η Αθήνα από τις δυνάμεις του ΕΛΑΣ."
    },
    {
        date: "2/12/1944",
        page: 22,
        text: "Οι πρώτοι 6.000 Βρετανοί στρατιώτες αποβιβάζονται στο Φάληρο. Ξεκινάει η ένοπλη αντιπαράθεση των μαχητών του ΕΛΑΣ με τις αστικές δυνάμεις και τους Βρετανούς, τα λεγόμενα «Δεκεμβριανά»."
    },
    {
        date: "3-4/12/1944",
        page: 22,
        text: "Γίνεται τεράστια κινητοποίηση του ΕΑΜ, ενάντια στον αφοπλισμό του ΕΛΑΣ. Στη γενική απεργία που προκηρύσσεται «νεκρώνουν» όλοι οι χώροι δουλειάς. Την επόμενη μέρα βρετανικά στρατεύματα και Τάγματα Ασφαλείας χτυπούν τον ΕΛΑΣ."
    },
    {
        date: "25/12/1944",
        page: 23,
        text: "Φτάνει στην Αθήνα ο πρωθυπουργός της Μεγάλης Βρετανίας, Ουίνστον Τσόρτσιλ. Ειδικό απόσπασμα του ΕΛΑΣ είχε ήδη μεταφέρει υπογείως δυναμίτη στα θεμέλια του ξενοδοχείου «Μεγάλη Βρετανία» στο Σύνταγμα, το οποίο λειτουργούσε ως στρατηγείο των Βρετανών. Όταν όμως έγινε γνωστό ότι ο Τσόρτσιλ ενδεχομένως διέμενε εκεί, η επιχείρηση ακυρώθηκε."
    },
    {
        date: "4/1/1945",
        page: 23,
        text: "Η ΚΕ του ΕΛΑΣ μετά από μέρες σφοδρών μαχών δίνει διαταγή για γενική σύμπτυξη προς Πεντέλη – Πάρνηθα. Χιλιάδες απλά μέλη των μαζικών λαϊκών οργανώσεων, του ΕΑΜ και του ΚΚΕ, ακολουθούν τον ΕΛΑΣ σε αυτήν την πορεία. Ξεκινάει η περίοδος τρομοκρατίας των αγωνιστών σε όλη την Ελλάδα."
    },
    {
        date: "12/2/1945",
        page: 24,
        text: "Ξεκινούν στη Βάρκιζα οι διαβουλεύσεις μεταξύ των εκπροσώπων του ΕΑΜ και της κυβέρνησης του Ν. Πλαστήρα. Υπογράφεται ο αφοπλισμός του ΕΛΑΣ, του ΕΛΑΝ (Ελληνικό Λαϊκό Απελευθερωτικό Ναυτικό) και της Εθνικής Πολιτοφυλακής."
    },
    {
        date: "1/5/1945",
        page: 24,
        text: "Η κόκκινη σημαία με το σφυροδρέπανο κυματίζει στην κορυφή του Γερμανικού Κοινοβουλίου στο Βερολίνο από τον Κόκκινο Στρατό."
    },
    {
        date: "12-15/2/1946",
        page: 24,
        text: "Συνέρχεται η 2η Ολομέλεια της Κεντρικής Επιτροπής του ΚΚΕ. Οι αποφάσεις της προσανατολίζουν στον ένοπλο αγώνα, όχι όμως σε γενικευμένο τρόπο και αποφασιστικά προσανατολισμένο ως σε τότε. Με ανακοίνωσή του το Πολιτικό Γραφείο της ΚΕ αποφάσισε να μην συμμετέχει στις επερχόμενες βουλευτικές εκλογές."
    },
    {
        date: "21/3/1946",
        page: 25,
        text: "Σε συνθήκες βίας και νοθείας πραγματοποιούνται οι βουλευτικές εκλογές. Την ίδια μέρα, ομάδα καταδιωκόμενων αγωνιστών επιτίθεται στον Σταθμό Χωροφυλακής Λιτόχωρου, που αποτελούσε χώρο βασανιστηρίων."
    },
    {
        date: "19/6/1946",
        page: 25,
        text: "Ψηφίζεται στη Βουλή το Γ΄ Ψήφισμα «Περί εκτάκτων μέτρων αφορώντων την Δημοσίαν τάξιν και ασφάλειαν»."
    },
    {
        date: "29/10/1946",
        page: 25,
        text: "Αποφασίζεται η συγκρότηση του Γενικού Αρχηγείου Ανταρτών, ουσιαστικά ιδρύεται ο Δημοκρατικός Στρατός Ελλάδας (ΔΣΕ)."
    },
    {
        date: "27/12/1946",
        page: 25,
        text: "Με διαταγή του Γενικού Αρχηγείου Ανταρτών, οι αντάρτικες δυνάμεις ονομάζονται Δημοκρατικός Στρατός της Ελλάδας (ΔΣΕ)."
    },
    {
        date: "19/3/1947",
        page: 26,
        text: "Ο πρόεδρος των Ηνωμένων Πολιτειών της Αμερικής Χ. Τρούμαν εξαγγέλλει το ομώνυμο δόγμα."
    },
    {
        date: "5/4/1947",
        page: 26,
        text: "Ξεκινά από τον κυβερνητικό στρατό η επιχείρηση «Τέρμινος» εναντίον του ΔΣΕ με κινητοποίηση πάνω από 100.000 στρατιωτών."
    },
    {
        date: "5/6/1947",
        page: 26,
        text: "Ανακοινώνεται από τον υπουργό Εξωτερικών των ΗΠΑ, Τζ. Μάρσαλ, το ομώνυμο Σχέδιο Μάρσαλ, που προέβλεπε για την Ελλάδα την παροχή στρατιωτικής βοήθειας με σκοπό να τσακιστεί το λαϊκό κίνημα."
    },
    {
        date: "10/8/1947",
        page: 26,
        text: "Το Γενικό Αρχηγείο του ΔΣΕ εκδίδει απόφαση με τίτλο «Καταστατικές διατάξεις για την Ελεύθερη Ελλάδα» με τα βασικά δικαιώματα του λαού στις απελευθερωμένες περιοχές."
    },
    {
        date: "11-12/9/1947",
        page: 27,
        text: "Συνέρχεται η 3η Ολομέλεια της ΚΕ του ΚΚΕ, η οποία αποφασίζει τη γενίκευση της κομματικής δουλειάς στον ένοπλο αγώνα."
    },
    {
        date: "18/10/1947",
        page: 27,
        text: "Απαγορεύεται και επίσημα η κυκλοφορία του Ριζοσπάστη και της Ελεύθερης Ελλάδας (εφημερίδα του ΕΑΜ)."
    },
    {
        date: "23/12/1947",
        page: 27,
        text: "Συγκροτείται η Προσωρινή Δημοκρατική Κυβέρνηση (ΠΔΚ) στις περιοχές της Ελεύθερης Ελλάδας. Στα τέλη του 1947 κυριαρχούσε στο 1/3 περίπου της ορεινής Ελλάδας και σε 4.000 περίπου χωριά."
    },
    {
        date: "25/12/1947",
        page: 27,
        text: "Ξεκινά η μάχη για την κατάληψη της Κόνιτσας από τον ΔΣΕ. Έπειτα από 6 μέρες μαχών, δυνάμεις του κυβερνητικού στρατού με τη συμβολή της αεροπορίας κατάφεραν να σπάσουν τον κλοιό του ΔΣΕ."
    },
    {
        date: "28/12/1947",
        page: 28,
        text: "Ορίζονται τα πρώτα 18 κομματικά στελέχη ως Πολιτικοί Επίτροποι του ΔΣΕ, ρόλος που στην συνέχεια επεκτάθηκε σε όλη τη δομή του."
    },
    {
        date: "15/3/1948",
        page: 28,
        text: "Μέσα σε 4 μήνες, οι μαχητές και μαχήτριες του ΔΣΕ κατασκεύασαν στη Βόρεια Πίνδο 7.400 πολυβολεία και οπλοπολυβολεία, 500 ολμοβολεία και 149,5 χιλιόμετρα χαρακωμάτων. Ο αρχηγός του Γενικού Επιτελείου του κυβερνητικού στρατού Δ. Γιαντζής θα μιλήσει για «οχυρά αριστοτεχνικά κατασκευασμένα»."
    },
    {
        date: "23/3/1948",
        page: 28,
        text: "Η ΠΔΚ αποφασίζει να πάρει μέτρα για την προστασία των παιδιών, τα οποία, πέρα από τον θάνατο λόγω του πολέμου, απειλούνται από την πείνα και τις αρρώστιες. Για τη διάσωσή τους απεστάλησαν στις σοσιαλιστικές χώρες, οι οποίες δέχτηκαν και φιλοξένησαν με τη συγκατάθεση των γονιών τους περίπου 25.000 παιδιά."
    },
    {
        date: "27/3/1948",
        page: 29,
        text: "Ο αστικός στρατός επιχειρεί δεύτερη επιδρομή κατά του ΔΣΕ (επιχείρηση «Ιέραξ») αξιοποιώντας ομάδες Λόχου Ορεινών Καταδρομών (ΛΟΚ). Η επιχείρηση αποτυγχάνει λόγω των αντεπιθέσεων του ΔΣΕ."
    },
    {
        date: "15/4/1948",
        page: 29,
        text: "Ο κυβερνητικός στρατός πραγματοποιεί εκκαθαριστικές επιχειρήσεις στη Ρούμελη (επιχείρηση «Χαραυγή»), με 30.000 άνδρες. Η επιχείρηση απέτυχε, ενώ ο ΔΣΕ κατάφερε σημαντικά χτυπήματα στον εχθρό."
    },
    {
        date: "14/6/1948",
        page: 29,
        text: "Ο κυβερνητικός στρατός εξαπολύει γενικευμένη επίθεση στη Βόρεια Πίνδο (Σχέδιο «Κορωνίς») με σκοπό την ολοκληρωτική συντριβή του ΔΣΕ."
    },
    {
        date: "28/8/1948",
        page: 30,
        text: "Ξεκινά η επιχείρηση «Ταύρος» με δυνάμεις 10.000 ανδρών των κυβερνητικών· επιτίθενται στις θέσεις του ΔΣΕ στη Μουργκάνα. Οι 1.000 περίπου μαχητές κράτησαν μέχρι και τις 16/9 όπου και πέρασαν στα Ζαγόρια με έναν επιτυχημένο ελιγμό."
    },
    {
        date: "30/8/1948",
        page: 30,
        text: "Μετά από την κατάληψη του Γράμμου, 25.000 άντρες του αστικού στρατού υποστηριζόμενοι με άρματα μάχης και αεροπλάνα εξαπολύουν επίθεση στο μέτωπο Βίτσι–Μάλι-Μάδι εναντίον 9.000 μαχητών του ΔΣΕ. Παρά τις αρχικές επιτυχίες του αστικού στρατού, ο ΔΣΕ τελικά τον κατατροπώνει και τον απωθεί."
    },
    {
        date: "25/10/1948",
        page: 30,
        text: "Πραγματοποιείται η ιδρυτική σύσκεψη της Πανελλαδικής Δημοκρατικής Ένωσης Γυναικών (ΠΔΕΓ) με σκοπό «να διαπαιδαγωγεί τις μαχήτριες μέλη της στο λαϊκό δημοκρατικό πνεύμα, στο πνεύμα του αγώνα»."
    },
    {
        date: "12/12/1948",
        page: 31,
        text: "Ο αστικός στρατός με δύναμη 44.000 ανδρών επιχειρεί το σχέδιο «Περιστέρα» με στόχο τη συντριβή του ΔΣΕ στην Πελοπόννησο. Σε μια νύχτα συλλαμβάνονται 4.500 άτομα και κατόπιν εξορίζονται στη Μακρόνησο και το Τρίκερι."
    },
    {
        date: "11/1/1949",
        page: 31,
        text: "Ο ΔΣΕ επιτίθεται κατά των κυβερνητικών δυνάμεων στη Νάουσα. Έπειτα από 2 ημέρες σκληρών επιθέσεων καταλαμβάνουν την πόλη, εξασφαλίζοντας εφόδια και στρατολογεί πάνω από 500 μαχητές."
    },
    {
        date: "19-21/1/1949",
        page: 31,
        text: "Ο ΔΣΕ καταλαμβάνει το Καρπενήσι. Η πόλη κρατιέται για 18 ημέρες, εξασφαλίζοντας πολεμικά εφόδια και πολύτιμους μαχητές."
    },
    {
        date: "20/1/1949",
        page: 32,
        text: "Οι επιτυχημένες χειμερινές αντεπιθέσεις του ΔΣΕ προκαλούν κρίση στο αστικό στρατόπεδο. Συγκροτείται νέα κυβέρνηση συνασπισμού, πρωθυπουργός της οποίας παραμένει ο Θ. Σοφούλης."
    },
    {
        date: "30-31/1/1949",
        page: 32,
        text: "Συνέρχεται η 5η Ολομέλεια της Κεντρικής Επιτροπής του ΚΚΕ, η οποία χαρακτηρίζεται από την πρόταση του Γενικού Γραμματέα Ν. Ζαχαριάδη για αλλαγή στην στρατηγική του Κόμματος, θέτοντας ως στρατηγικό στόχο του ΚΚΕ την σοσιαλιστική επανάσταση."
    },
    {
        date: "11-12/2/1949",
        page: 32,
        text: "Ο ΔΣΕ πραγματοποιεί μεγάλη επιχείρηση στη Φλώρινα αλλά ηττάται έπειτα από σφοδρότατες μάχες με βαριές απώλειες. Ο αστικός στρατός εκτελεί επιτόπου δεκάδες τραυματίες και αιχμαλώτους του ΔΣΕ, ενώ κατόπιν θάβει σε ομαδικό λάκκο εκατοντάδες μαχητές και τραυματίες μαζί."
    },
    {
        date: "31/3-1/4/1949",
        page: 33,
        text: "Δυνάμεις του ΔΣΕ διεισδύουν στο Γράμμο με μια αιφνιδιαστική επίθεση κατά του κυβερνητικού στρατού, πετυχαίνοντας την ανακατάληψη του Γράμμου. Αυτή ήταν από τις πλέον εντυπωσιακές επιχειρήσεις του ένοπλου ταξικού αγώνα με την αναλογία δυνάμεων να είναι 5/1 υπέρ του κυβερνητικού στρατού."
    },
    {
        date: "21/4/1949",
        page: 33,
        text: "Η 2η Μεραρχία του ΔΣΕ πραγματοποιεί μεγάλη διείσδυση διάρκειας 2 μηνών στη Ρούμελη με τη δύναμη δύο εκατοντάδων μαχητών στα όρια της φυσικής τους αντοχής. Έπειτα από άνισο αγώνα εναντίον 40.000 στρατιωτών σταδιακά η μεραρχία αποδεκατίζεται, ενώ στις 21/6/1949 σκοτώνεται και ο διοικητής της Μεραρχίας, ο θρυλικός Διαμαντής."
    },
    {
        date: "4/4/1949",
        page: 33,
        text: "Ιδρύεται ο ιμπεριαλιστικός οργανισμός στρατιωτικής συμμαχίας του ΝΑΤΟ."
    },
    {
        date: "20/4/1949",
        page: 34,
        text: "Η ΠΔΚ τυπώνει πρόταση ειρήνευσης με βασικούς άξονες τη διαμεσολάβηση του ΟΗΕ, την κατάπαυση πυρός, τη χορήγηση γενικής αμνηστίας, τη διεξαγωγή αδιάβλητων εκλογών. Η ΕΣΣΔ την κατοθέτει στον ΟΗΕ, όμως η ελληνική αστική κυβέρνηση και οι διεθνείς της σύμμαχοι δεν προχωρούν σε συμβιβασμό."
    },
    {
        date: "20/7/1949",
        page: 34,
        text: "Ξεκινούν στο Σάμο μεγάλες επιχειρήσεις εκκαθάρισης από τον κυβερνητικό στρατό. Πολλοί μαχητές του ΔΣΕ σκοτώνονται και άλλοι αυτοκτονούν για να μην παραδοθούν."
    },
    {
        date: "2/8/1949",
        page: 34,
        text: "Ξεκινά στον Γράμμο και το Βίτσι το σχέδιο «Πυρσός» του κυβερνητικού στρατού. Στοχεύει να εξοντώσει τον ΔΣΕ πριν προλάβει να υποχωρήσει στην Αλβανία. Ο κίνδυνος περικύκλωσης στο Βίτσι δυνάμωνε και ο ΔΣΕ ελίχτηκε προς τον Γράμμο όπου ολοκλήρωσε επιτυχώς τη συντεταγμένη υποχώρησή του προς την Αλβανία."
    },
    {
        date: "29/8/1949",
        page: 35,
        text: "Το Γενικό Επιτελείο Στρατού αποφασίζει τη μετακίνηση δυνάμεων προς την Ανατολική Μακεδονία και Θράκη για την αντιμετώπιση των 1.500 μαχητών του ΔΣΕ που υπήρχαν εκεί. Σε όλη την Ελλάδα, οι εναπομείναντες μαχητές του ΔΣΕ κυνηγήθηκαν."
    },
    {
        date: "9/10/1949",
        page: 35,
        text: "Η 6η Ολομέλεια της Κεντρικής Επιτροπής κηρύσσει τον τερματισμό του ένοπλου αγώνα και τη μεταφορά του κέντρου βάρους της δουλειάς του Κόμματος «στην οργάνωση και καθοδήγηση των οικονομικών και πολιτικών αγώνων όλων των στρωμάτων του εργαζόμενου λαού»."
    }
];
